<!DOCTYPE html>
<html>
<head>
	<title>課程申請表</title>
</head>
<body>
	<h1>申請問題回答</h1>
	<hr/>
	<ul>
		<li>個人簡介</li>
			<tr>我的名字是，2020年畢業於高醫大，畢業後投入職場快兩年後，我發現自己不想要日復一日相似的工作內容，我期待工作更具有挑戰性，需要思考並付諸行動去真正完成一件事，並能從中獲得成就感。因此我開始尋找什麼工作更能符合我的期待，於是我找到了軟體工程師這份職業，從治療師想轉職成工程師，聽到的人都說這兩個相差太大，我自己身為學習者也明白這條路不容易，可以學習的知識太多，還有學習過程中對自己的懷疑，這兩點是我想申請參加這個計畫的主要原因！雖然一路挫折，但我不願意輕易放棄。</tr>
		<li>為了成為軟體工程師，曾做過什麼努力？</li>
			<tr>我註冊了FREECODECAMP的會員並依序完成裡面的課程，目前已經完成從Legacy Responsive Web Design到Data Visualization，有基礎的前端知識，計畫會繼續完成剩下的課程，並且有開始在Udemy上學習網頁設計課程，目前在學習計畫中的有Spring & Hibernate for Beginners (includes Spring Boot)（持續進行中）</tr>
		<li>如果參與這個計畫，會怎麼安排學習時間？</li>
			<tr>因想把重心放在學習及轉職這條路，之後會全職投入學習，正式開課後會安排一週內有五天是每天七到八小時的專注學習，時間上會分割成三小時+四小時或三小時+三小時+兩小時，假日兩天會有至少十小時，一週會花五十到六十小時在課程及作業中。
申請時段的八月到九月正式開課前，在結束前一份全職工作交接後，同樣會依照以上的時刻表學習，除了提前適應自己安排的學習週期以外，先繼續加強自身能力以便未來能順利跟上課程進度。
</tr>
		<li>是否有想要加入的軟體公司？為什麼想加入該公司？</li>
			<tr>我曾經思考過這個問題，就我目前了解能想到的知名公司，我想他們應該都不是一個新手能說想加入就加入的，但曾經看過前兩屆的校友經驗分享，有看到一位女生很厲害地應徵上了微軟的工作，如果給自己一份期許和持續往前的動力，我希望自己未來也能加入一間大型外商軟體公司。</tr>
		<li>請描述一件你曾經碰到最困難的事情，如何克服？</li>
			<tr></tr>
		<li>關於這份申請網頁，請分享一個你開發時的技術心得。</li>
		<li>想要對我們說的事情？</li>
			<tr></tr>

		
	</u1>
</body>
</html>
